// Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.


let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
console.log(friends);
if (friends.length >= 3){
    console.log('big array')
}else {
    console.log('small array')}


// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
//


let a= 10;
let y = 30;
let z = 20;



if ((a > y && a < c) || (a < y && a > c)){
    console.log(a)
} else if ((y>a && y<z) || (y < a && y > z )){
    console.log(y)
}else if ((z>a && z<y) || (z < a && z > y )){
    console.log(z)
}





